# SL_UpdateSAcc

## Description
Updates an esisting Static Accessory UID in the data exchange file.

```pascal
PROCEDURE SL_UpdateSAcc(
				InstHand : HANDLE;
				InstUID  : DYNARRAY[] of CHAR);
```

```python

def vs.SL_UpdateSAcc(InstHand, InstUID):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|InstHand|HANDLE||
|InstUID|DYNARRAY[] of CHAR||

## Version
Availability: from Vectorworks 2012
## Category
* Spotlight